app/views/users/index.html.erb

						<td><%= user.email %></td>
						<td><% user.customers && user.customers.each do |cutomer| %>
---
SELECT `customers`.* FROM `customers` INNER JOIN `customers_users` ON `customers`.`id` = `customers_users`.`customer_id` WHERE `customers_users`.`user_id` = 3