app/views/users/show.html.erb

							<td class="td_width" style="background-color: lightgray;">Assigned Customers</td>
							<td><% if @user.customers.present? %>
---
SELECT `customers`.* FROM `customers` INNER JOIN `customers_users` ON `customers`.`id` = `customers_users`.`customer_id` WHERE `customers_users`.`user_id` = 2