app/controllers/customers_controller.rb

	def create
		puts "----"*90
		user_client = current_user.client
		params[:customer][:creator_id] = current_user.id
		customer = user_client.customers.build(params_customer)
		# if customer.save
		cus_user = CustomersUser.new
		cus_user.user_id = current_user.id
		cus_user.customer_id = customer.id
		cus_user.save!
		# flash[:success] = "Customer successfully created."
		# redirect_to user_customers_path(current_user)
		respond_to do |format|
			if customer.save
				create_address(params,customer)
				if current_user.role == "client"
					users = params[:customer][:userid] if params[:customer][:userid].present?
					users && users.each do |user|
						if user != ""
							cus_user = CustomersUser.new
							cus_user.user_id = user.to_i
							cus_user.customer_id = customer.id
							cus_user.save!
						end
					end
				end
				cus_user = CustomersUser.where(user_id:current_user.id, customer_id: customer.id).first || CustomersUser.new
				cus_user.user_id = current_user.id
				cus_user.customer_id = customer.id
				cus_user.save!
---
INSERT INTO `customers_users` (`created_at`, `customer_id`, `updated_at`, `user_id`) VALUES ('2014-08-12 10:08:34', 2, '2014-08-12 10:08:34', 2)
INSERT INTO `customers` (`agent_name`, `bill_of_laden`, `charges`, `created_at`, `creator_id`, `date_of_pickup`, `destination_address`, `loading_address`, `name`, `phone`, `tag_lot_color`, `tag_lot_number`, `updated_at`) VALUES ('h', 'hggh', 'jhh', '2014-08-12 10:17:44', 2, '2014-02-01', 'hhhh', 'hhh', 'hhhh', 'hhh', 'h', 'hh', '2014-08-12 10:17:44')
SELECT `customers_users`.* FROM `customers_users` WHERE `customers_users`.`user_id` = 2 AND `customers_users`.`customer_id` = 6 ORDER BY `customers_users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `customers` SET `loading_address` = 'house#4, Lahore, Pakistan, 54000', `destination_address` = '65-D DHA, Lahore, Pakistan, 54000', `updated_at` = '2014-08-21 12:44:06' WHERE `customers`.`id` = 14
UPDATE `users` SET `last_sign_in_at` = '2014-08-18 09:11:00', `current_sign_in_at` = '2014-08-18 09:11:23', `sign_in_count` = 13, `updated_at` = '2014-08-18 09:11:23' WHERE `users`.`id` = 2

	def edit
		@customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1

	def update
		puts "===="*90
		@customer = Customer.find(params[:id])
    	flash[:notice] = 'Customer was successfully updated.' if @customer.update(params_customer)
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
UPDATE `customers` SET `name` = 'faisal', `phone` = '3324167729', `bill_of_laden` = 'was23', `loading_address` = '83-H DHA', `destination_address` = '84-H DHA', `tag_lot_number` = '23', `tag_lot_color` = 'white', `agent_name` = 'zeeshan', `charges` = '23k', `updated_at` = '2014-08-18 09:44:10' WHERE `customers`.`id` = 5

	def users
		@customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1

	def close_customer
		customer = Customer.find(params[:id])
		customer.close = true
		customer.close_date = DateTime.now
		customer.save!
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 7 LIMIT 1
UPDATE `customers` SET `close` = 1, `close_date` = '2014-08-19 06:44:34', `updated_at` = '2014-08-19 06:44:34' WHERE `customers`.`id` = 7

	def assign_customer
		@customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1

	def unassign
		@customer = Customer.find(params[:id])
		cust_user = CustomersUser.where(customer_id: @customer.id, user_id: params[:uid]).first
		cust_user.destroy if cust_user.present?
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
SELECT `customers_users`.* FROM `customers_users` WHERE `customers_users`.`customer_id` = 4 AND `customers_users`.`user_id` = 2 ORDER BY `customers_users`.`id` ASC LIMIT 1
DELETE FROM `customers_users` WHERE `customers_users`.`id` = 3
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

	def add_users

		id = params[:customerid]
		users = params[:customer][:userid] if params[:customer][:userid].present?
		customer = Customer.find(id)
		users && users.each do |user|
			if user != ""
				customer_user =  CustomersUser.where(user_id: user , customer_id: id).first || CustomersUser.new
				customer_user.user_id = user.to_i
				customer_user.customer_id = id.to_i
				customer_user.save!
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
SELECT `customers_users`.* FROM `customers_users` WHERE `customers_users`.`user_id` = 3 AND `customers_users`.`customer_id` = 4 ORDER BY `customers_users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `customers_users` (`created_at`, `customer_id`, `updated_at`, `user_id`) VALUES ('2014-08-13 07:28:38', 4, '2014-08-13 07:28:38', 3)

	def show
		@customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 12 LIMIT 1