app/controllers/items_controller.rb

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`customer_id` = 10 AND `items`.`cn` = 1
---
	def index

		@customer = Customer.find(params[:customer_id])
		@items = @customer.items.where(cn: true)

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 4 LIMIT 1
SELECT COUNT(*) FROM `items` WHERE `items`.`customer_id` = 10
---
	def new
		@customer = Customer.find(params[:customer_id])
		@item = @customer.items.build
		@count = @customer.items.count

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 13 LIMIT 1
SELECT COUNT(*) FROM `items` WHERE `items`.`customer_id` = 10
UPDATE `items` SET `item_number` = '22ww', `description_at_origin` = 'sdjsdjk', `driver` = 'kjsdgsjkdg', `warehouse_cross` = 'gjksdgsjkdg', `warehouse` = 'ksgdsjkdg', `desr_symbole` = 'sdsdasd', `shipper` = 'sdsdsd', `exception_symbol` = 'sdsdasdasd', `exception` = 'sdsds', `file1` = NULL, `file2` = NULL, `updated_at` = '2014-08-21 09:43:16' WHERE `items`.`id` = 13
DELETE FROM `items` WHERE `items`.`id` = 11
SELECT `items`.* FROM `items` WHERE `items`.`customer_id` = 10 AND `items`.`cn` = 0
---
	def create
		customer = Customer.find(params[:customer_id])
		# @item = customer.items.build(params_item)
		@item = Item.find(params[:itemid])
		# @item.item_number = params[:item][:item_number]
		@count = customer.items.count
		@item.item_number = @count+1
		@item.article = params[:item][:article]
		@item.description_at_origin = params[:item][:description_at_origin]
		@item.driver = params[:item][:driver]
		@item.warehouse_cross = params[:item][:warehouse_cross]
		@item.warehouse = params[:item][:warehouse]
		@item.desr_symbole = params[:item][:desr_symbole]
		@item.shipper = params[:item][:shipper]
		@item.exception_symbol = params[:item][:exception_symbol]
		@item.location_symbol = params[:item][:location_symbol]
		@item.exception = params[:item][:exception]
		@item.file1 = params[:item][:file1]
		@item.file2 = params[:item][:file2]

		respond_to do |format|
			if @item.save
				@item.cn = true
				@item.save!
				customer.items.where(cn: false).destroy_all

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
SELECT COUNT(*) FROM `items` WHERE `items`.`customer_id` = 10
---
	def edit
		@item = Item.find(params[:id])
		@customer = Customer.find(params[:customer_id])
		@count = @customer.items.count

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
UPDATE `items` SET `item_number` = 'asw3', `file1` = 'faisal.jpg', `file2` = '1.png', `updated_at` = '2014-08-13 11:08:12' WHERE `items`.`id` = 1
---
	def update
		@customer = Customer.find(params[:customer_id])
		@item = Item.find(params[:id])
		@item.update_attributes(params_item)

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 1
---
	def destroy
		@item = Item.find(params[:id])
		@customer = Customer.find(params[:customer_id])
		@item.destroy if @item.present?

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 5 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
---
	def show   # it is using to show details of the closed customer items
		@customer = Customer.find(params[:customer_id])
		@item = Item.find(params[:id])

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 10 LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`id` = 16 LIMIT 1
UPDATE `items` SET `file1` = 'upload20140821-2293-71kweq.jpg', `updated_at` = '2014-08-21 09:57:49' WHERE `items`.`id` = 16
---
	def upload_image   #upload image through app
		@customer = Customer.find(params[:customer_id])
		@item = Item.find(params[:id])
		# if params[:item][:itemId].present?
		# 	@item = Item.find(params[:itemId])
		# else
		# 	@item = @customer.items.build
		# end
		if params[:item][:file1].present?
			@item.file1 = uploaded_picture(params[:item][:file1]) if params[:item][:file1].present?
			@item.save!

SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 10 LIMIT 1
SELECT COUNT(*) FROM `items` WHERE `items`.`customer_id` = 10
INSERT INTO `items` (`created_at`, `customer_id`, `updated_at`) VALUES ('2014-08-21 09:13:34', 10, '2014-08-21 09:13:34')
---
	def empty_item    # this function using only for mob app to create empty item
		@customer = Customer.find(params[:customer_id])
		@count = @customer.items.count
		item = @customer.items.build
		item.save!