app/controllers/items_controller.rb

INSERT INTO `items` (`created_at`, `customer_id`, `description_at_origin`, `desr_symbole`, `driver`, `exception`, `exception_symbol`, `file1`, `file2`, `item_number`, `shipper`, `updated_at`, `warehouse`, `warehouse_cross`) VALUES ('2014-08-13 10:42:16', 5, 'jhgjhg', 'jhg', 'jhgjh', 'ghjg', 'jhg', '1.png', 'original.png', 'jgjhg', 'jhgjh', '2014-08-13 10:42:16', 'gjhg', 'jhg')
---
	def create
		customer = Customer.find(params[:customer_id])
		@item = customer.items.build(params_item)
		respond_to do |format|
			if @item.save