app/controllers/sessions_controller.rb

  def create
    if request.method == "options" || request.method=="OPTIONS"
      render :nothing => true, :status => 200
      return
    end
    email = ""
    password = ""
    if request.format == "json"
      email = params[:data][:user][:email]
      password = params[:data][:user][:password]
    else
      email = params[:user][:email]
      password = params[:user][:password]
    end

    resource = User.find_for_database_authentication(email: email)

    return invalid_login_attempt unless resource

    if resource.valid_password?(password)
      sign_in(resource)
      random = SecureRandom.hex
      resource.tokens << Token.create!(api: random)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'admin@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `tokens` (`api`, `created_at`, `updated_at`) VALUES ('408ad6d037c772f4b8d2eed8d769cc11', '2014-08-12 08:47:08', '2014-08-12 08:47:08')