app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO `users` (`address`, `company`, `created_at`, `email`, `encrypted_password`, `first_name`, `last_name`, `phone`, `updated_at`) VALUES ('83-H DHA Lahore', 'devsinc', '2014-08-12 08:54:11', 'faisal.bhatti@devsinc.com', '$2a$10$VwmnumkGeaFBYqsdM4HwX.frNbJ4PSXR9c0.vH1jZeAh8Ap0QBddO', 'faisal', 'bhatti', '332467729', '2014-08-12 08:54:11')

	def add_user

		@user = User.new
		notice = ''
		# puts "A"*30
		params['user']=JSON.parse(params['user'])
		@user.email = params['user']['email']
		@user.first_name = params['user']['first_name']
		@user.last_name = params['user']['last_name']
		@user.password = params['user']['password']
		@user.password_confirmation = params['user']['password_confirmation']
		@user.company = params['user']['company']
		@user.phone = params['user']['phone']
		@user.address = params['user']['address']
		if @user.save
---
INSERT INTO `users` (`address`, `company`, `created_at`, `email`, `encrypted_password`, `first_name`, `last_name`, `phone`, `updated_at`) VALUES ('83-H DHA', 'devsinc', '2014-08-18 13:06:36', 'usman@devsinc.com', '$2a$10$rj4MnOUAechBrAzBQJ7H0.giE.e7Vk6V4y2g6dOCUV42wc5tMZrvW', 'usman', 'asif', '3322222', '2014-08-18 13:06:36')

	def adduser
		@user = User.new
		notice = ''
		# puts "A"*30
		# params['user']=JSON.parse(params['user'])
		@user.email = params['user']['email']
		@user.first_name = params['user']['first_name']
		@user.last_name = params['user']['last_name']
		@user.password = params['user']['password']
		@user.password_confirmation = params['user']['password_confirmation']
		@user.company = params['user']['company']
		@user.phone = params['user']['phone']
		@user.address = params['user']['address']
		if @user.save
---
INSERT INTO `users` (`address`, `company`, `created_at`, `email`, `encrypted_password`, `first_name`, `last_name`, `phone`, `updated_at`) VALUES ('sdsd', 'sdsd', '2014-08-21 14:00:23', 'usman@aa.com', '$2a$10$E5L2EYXK9hQMNRYPX5xa4OkTfK6biVF3ArgxnqbTmAuoLaZnUSEg2', 'aaa', 'aa', 'sdsd', '2014-08-21 14:00:23')

	def index

		if current_user.admin?
			# @users = User.all
			@users = User.where(role: "client")
---
SELECT `users`.* FROM `users` WHERE `users`.`role` = 'client'

	def show
		@user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

	def find_user
		@user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1